tsung/comments_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
      <server host="www.emergency-testing.zgxk8jxz26.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="100" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="100" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase> 
   </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="read-home" probability="45" type="ts_http">
      <request>
        <http url='/events' version='1.1' method='GET'></http>
      </request>
      <thinktime min="2" max="5" random="true"></thinktime>
    </session>



    <session name="read-specific-event" probability="45" type="ts_http">
      <request>
        <http url='/events' version='1.1' method='GET'></http>
      </request>

      <thinktime min="2" max="5" random="true"></thinktime>

      <request>
        <http url='/events/50' version='1.1' method='GET'></http>
      </request>
    </session>

    <session name="create-event" probability="10" type="ts_http">
      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/events/new' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars> 

      <request subst="true">
          <http url='/events' method='POST' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;event[title]=Test&amp;event[description]=Testing&amp;event[lat]=34.4208&amp;event[long]=-119.6982" content_type="application/x-www-form-urlencoded"></http>
      </request>
    </session>


  </sessions>

</tsung>